# define _CRT_SECURE_NO_WARNINGS 1
# include <stdio.h>
# include <math.h>
# include <string.h>
# include <stdlib.h>
# include <Windows.h>
# include <time.h>

int main_58(void)
{
	//1、除法与取模运算
	//int  a = 5 / 2;//商2余1
	//printf("a = %d\n", a);//2

	//int  a = 5 % 2;
//printf("a = %d\n", a);//1

//double a = 5 / 2.0;
//printf("a = %lf\n", a);//2.500000

//取模[%]只能针对整形数据
//***********************************************************
//***********************************************************
//2、移位操作符,,前提操作数为整数
//右移
/*
1.算术右移[默认]
	右边丢弃，左边补原符号位[正数为0，负数为1]
2.逻辑右移
	右边丢弃，左边补0
*/
/*
整数的二进制表示：原码、反码[原码符号位不变，其他为按位取反]、补码[反码加1]

存储在内存的是补码，正数的三种表示形式相同
*/

/*
以数字-1为例：

原码-----10000000|00000000|00000000|00000001
反码-----11111111|11111111|11111111|11111110
补码-----11111111|11111111|11111111|11111111
*/
//int a = -1;			//11111111|11111111|11111111|11111111
//int b = a >> 2;		//11111111|11111111|11111111|11111111
//printf("b= %d\n", b);//-1


//左移
/*
左边丢弃，右边补0

左移1位相当于乘2一次幂的效果
*/
//int a = 5;		//00000000 | 00000000 | 00000000 | 00000101
//int b = a << 2; //00000000 | 00000000 | 00000000 | 00001010
//printf("b=%d\n", b);

/*
提示：对于移位运算符，不要移动负数位
例如：int temp =4;temp>>-1;
*/
//***********************************************************
//***********************************************************
//3、位操作符[&:按位与、|:按位或、^:按位异或、],前提操作数为整数
//&:按位与[有0则0，全1为1]
//int a = 3;		// 00000000|00000000|00000000|00000011
//int b = 5;		// 00000000|00000000|00000000|00000101
//int c = a & b;	// 00000000|00000000|00000000|00000001
//printf("c= %d", c);
//| :按位或[有1则1，全0为0]
//int a = 3;		// 00000000|00000000|00000000|00000011
//int b = 5;		// 00000000|00000000|00000000|00000101
//int c = a | b;	// 00000000|00000000|00000000|00000111
//printf("c= %d", c);
//^ :按位异或[形同为0，相异为1]
//int a = 3;		// 00000000|00000000|00000000|00000011
//int b = 5;		// 00000000|00000000|00000000|00000101
//int c = a ^ b;	// 00000000|00000000|00000000|00000110
//printf("c= %d", c);

//交换两个数，不使用中间变量
	int a = 3, b = 5;
	//加减法-[可能会溢出]
	//a = a + b;
	//b = a - b;
	//a = a - b;
	//printf("a=%d b=%d\n", a, b);

	//异或法
	/*a ^= b;
	b ^= a;
	a ^= b;
	printf("a=%d b=%d\n", a, b);*/

	//求一个整数存储在内存中的二进制中1的个数
	int num = 0, count = 0;
	scanf("%d", &num);
	//统计num的补码中1的个数
	//方法一：
	/*while (num != 0)
	{
		if (num % 2 == 1)
			count++;
		num = num / 2;
	}*/
	//方法二：
	//for (int i = 0; i < 32; i++)
	//{
	//	if (1 == ((num >> i) & 1))
	//		count++;
	//}
	//printf("1的个数有：%d个\n", count);
	//方法三：
	//while (num)
	//{
	//	count++;
	//	num &= (num - 1);
	//}

	//printf("1的个数有：%d个\n", count);
	//***********************************************************
	//***********************************************************



	return 0;
}