#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include "Function.h"


//数组指针--实质为指针【指向数组的指针--可以存放数组的地址】
//int main(void)
//{
//	//int* p = NULL;//整形指针--指向整形的指针--可以存放整形的地址
//	//char* pc = NULL;//pc是字符指针--指向字符的指针--可以存放字符的地址
//
//	int arr[10] = { 0 };
//	/*
//	arr--首元素地址
//	&arr[0]--首元素地址
//	&arr--数组地址
//	*/
//
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int(*p)[10] = &arr;//数组的地址要存起来[p就是一个数组指针]
//
//	return 0;
//}


//int main(void)
//{
//	/*char* arr[5];
//	char* (*pa)[5] = &arr;*/
//	/*
//	pa、【指针变量的名字】
//	*【说明pa是指针】
//	[5]【pa指向的数组是5个元素】
//	char*【pa指向的数组的元素类型是char*】
//	*/
//
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;
//	int(*pa)[10] = &arr;
//	int i = 0;
//
//	/*for (i = 0; i < 10; i++)
//	{
//		printf("%d ", (*pa)[i]);
//
//	}*/
//
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%d ", *(*pa + i));//*pa==arr
//
//	//}
//
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}
//	return 0;
//}


void printsz1(int arr[3][5], int x, int y)
{
	int i = 0, j = 0;
	for (i = 0; i < x; i++)
	{
		for (j = 0; j < y; j++)
		{
			printf("%d", arr[i][j]);
		}
		printf("\n");
	}
}
void printsz2(int(*p)[5], int x, int y)
{
	int i = 0;
	for (i = 0; i < x; i++)
	{

		int j = 0;
		for (j = 0; j < y; j++)
		{
			//printf("%d ", p[i][j]);
			//printf("%d ", *(p[i] + j));
			//printf("%d ", *(*((p + i) + j)));
			printf("%d ", (*p + i)[j]);
		}
		printf("\n");
	}
}
int main_85_1(void)
{

	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
	//printf("%d", (arr, 3, 5));
	printsz1(arr, 3, 5);
	printsz2(arr, 3, 5);

	return 0;
}
/*
int arr[5];------------------arr是一个5个元素的整形数组
int *parr1[10];--------------parr1 是一个数组，数组有10个元素，每个元素的类型是int*,所有parr1是一个指针的数组
int (*parr2)[10];------------parr2 是一个指针，该指针指向了一个数组，数组有10个元素，每个元素的类型为int,所以parr2是数组指针
int (*parr3[10])[5];---------parr3是一个数组，该数组的有10个元素，每个元素是一个数组指针，该数组的指针指向的数组有5个元素，每个元素的int类型

*/




/*
():左结合，优先级：1
++:右结合，优先级：2
+：左结合，优先级：4
=：右结合，优先级：14
*/
int main_85_2(void)
{
	int i = 2, z;
	z = (i++) + (i++) + (i++);

	printf("%d %d", z, i);

	return 0;
}


/*
按照当前的C语言语法[https://learn.microsoft.com/zh-cn/cpp/c-language/?view=msvc-170]规定：

运算顺序：先执行(i++)，然后再依次相加，最后赋值给z


1.即每个()内的表达式优先级一致，由于自增的对象均为同一变量，所以变量的值会受前自增/自减的影响(后自增/自减在同一表达式内暂1不受影响，相关变量的值暂时不变)

2.当出现一个前自增/自减时，所有变量值均进行前自增/自减（优先级一致）。

3.在进行后自增/自减时参与的运算时，实际参与运算变量的值不变，真实值已随着表达式运算中的自增/自减以及表达式是结合性而逐步改变

4.不同的编译器的版本不同，处理运算符优先级的方式有差异，个别编译器会将后自增/自减的值作为参与运算的值

*/




